Tekla Open API Reference for Tekla Structures 2025
LineSegment Constructor
Overload List
Name | Description
LineSegment()
 Instantiates a line segment with both the starting point and the end point zeroed.
LineSegment(Point, Point)
 Instantiates a line segment with the given points.
Top
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace